stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_hal_rcc.h
/**
  ******************************************************************************
  * @file    stm32wbaxx_hal_rcc.h
  * @author  MCD Application Team
  * @brief   Header file of RCC HAL  module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32WBAxx_HAL_RCC_H
#define __STM32WBAxx_HAL_RCC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32wbaxx_hal_def.h"
#include "stm32wbaxx_ll_rcc.h"

/** @addtogroup STM32WBAxx_HAL_Driver
  * @{
  */

/** @addtogroup RCC
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup RCC_Exported_Types RCC Exported Types
  * @{
  */

/**
  * @brief  RCC PLL1 configuration structure definition
  */
typedef struct
{
  uint32_t PLLState;        /*!< The new state of the PLL1.
                                 This parameter can be a value of @ref RCC_PLL_Config                     */

  uint32_t PLLSource;       /*!< RCC_PLLSource: PLL1 entry clock source.
                                 This parameter must be a value of @ref RCC_PLL_Clock_Source              */

  uint32_t PLLM;            /*!< PLLM: Division factor for PLL1 VCO input clock.
                                 This parameter must be a number between Min_Data = 1 and Max_Data = 8    */

  uint32_t PLLN;            /*!< PLLN: Multiplication factor for PLL1 VCO output clock.
                                 This parameter must be a number between Min_Data = 4 and Max_Data = 512   */

  uint32_t PLLP;            /*!< PLLP: Division factor for system clock.
                                 This parameter must be a number between Min_Data = 1 and Max_Data = 128  */

  uint32_t PLLQ;            /*!< PLLQ: Division factor for peripheral clocks.
                                 This parameter must be a number between Min_Data = 1 and Max_Data = 128  */

  uint32_t PLLR;            /*!< PLLR: Division factor for peripheral clocks.
                                 This parameter must be a number between Min_Data = 1 and Max_Data = 128  */

  uint32_t PLLFractional;   /*!< PLLFRACN: Specifies Fractional Part Of The Multiplication Factor for
                                 PLL1 VCO It should be a value between 0 and 0x1FFF                       */

} RCC_PLLInitTypeDef;

/**
  * @brief  RCC Internal/External Oscillator (HSE, HSI, MSI, LSE and LSI1) configuration structure definition
  */
typedef struct
{
  uint32_t OscillatorType;       /*!< The oscillators to be configured.
                                      This parameter can be a value of @ref RCC_Oscillator_Type                   */

  uint32_t HSEState;             /*!< The new state of the HSE.
                                      This parameter can be a value of @ref RCC_HSE_Config                        */

  uint32_t HSEDiv;               /*!< The division factor of the HSE. Applicable only to SYSCLK when HSE is source.
                                      This parameter can be a value of @ref RCC_HSE_Div                           */

  uint32_t LSEState;             /*!< The new state of the LSE.
                                      This parameter can be a value of @ref RCC_LSE_Config                        */

  uint32_t HSIState;             /*!< The new state of the HSI.
                                      This parameter can be a value of @ref RCC_HSI_Config                        */

  uint32_t HSICalibrationValue;  /*!< The calibration trimming value (default is RCC_HSICALIBRATION_DEFAULT).
                                      This parameter must be a number between Min_Data = 0x00 and Max_Data = 0x7F
                                      on the other devices */

  uint32_t LSIState;             /*!< The new state of the LSI (LSI1 or LSI2 when applicable).
                                      This parameter can be a value of @ref RCC_LSI_Config                        */

  uint32_t LSIDiv;               /*!< The division factor of the LSI. Applicable only to LSI1.
                                      This parameter can be a value of @ref RCC_LSI_Div                           */

  RCC_PLLInitTypeDef PLL1;       /*!< Main PLL1 structure parameters                                              */

} RCC_OscInitTypeDef;

/**
  * @brief  RCC System, AHB and APB busses clock configuration structure definition
  */
typedef struct
{
  uint32_t ClockType;               /*!< The clock to be configured.
                                         This parameter can be a value of @ref RCC_System_Clock_Type      */

  uint32_t SYSCLKSource;            /*!< The clock source used as system clock (SYSCLK).
                                         This parameter can be a value of @ref RCC_System_Clock_Source    */

  uint32_t AHBCLKDivider;           /*!< The AHB clock (HCLK) divider. This clock is derived from the system clock (SYSCLK).
                                         This parameter can be a value of @ref RCC_AHB_Clock_Source */

  uint32_t APB1CLKDivider;          /*!< The APB1 clock (PCLK1) divider. This clock is derived from the AHB clock (HCLK).
                                         This parameter can be a value of @ref RCC_APB1_APB2_APB7_Clock_Source */

  uint32_t APB2CLKDivider;          /*!< The APB2 clock (PCLK2) divider. This clock is derived from the AHB clock (HCLK).
                                         This parameter can be a value of @ref RCC_APB1_APB2_APB7_Clock_Source */

  uint32_t APB7CLKDivider;          /*!< The APB7 clock (PCLK7) divider. This clock is derived from the AHB clock (HCLK).
                                         This parameter can be a value of @ref RCC_APB1_APB2_APB7_Clock_Source */

  uint32_t AHB5_PLL1_CLKDivider;    /*!< The AHB5 clock (HCLK5) divider when PLL1 is source of SYSCLK. This clock is derived from the system clock (SYSCLK).
                                         This parameter can be a value of @ref RCC_AHB5_PLL1_Clock_Source       */

  uint32_t AHB5_HSEHSI_CLKDivider;  /*!< The AHB5 clock (HCLK5) divider when HSI or HSE are sources of SYSCLK. This clock is derived from the system clock (SYSCLK).
                                         This parameter can be a value of @ref RCC_AHB5_HSEHSI_Clock_Source       */

