stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_hal_rcc.h
} RCC_ClkInitTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCC_Exported_Constants RCC Exported Constants
  * @{
  */

/** @defgroup RCC_Peripheral_Memory_Mapping Peripheral Memory Mapping
  * @{
  */

/**
  * @}
  */

/** @defgroup RCC_Timeout_Value Timeout Values
  * @{
  */
#define RCC_DBP_TIMEOUT_VALUE           (2U)    /* 2 ms (minimum Tick + 1) */
#define RCC_LSE_TIMEOUT_VALUE           LSE_STARTUP_TIMEOUT
/**
  * @}
  */

/** @defgroup RCC_Oscillator_Type Oscillator Type
  * @{
  */
#define RCC_OSCILLATORTYPE_NONE         0x00000000U   /*!< Oscillator configuration unchanged */
#define RCC_OSCILLATORTYPE_HSE          0x00000001U   /*!< HSE32 to configure */
#define RCC_OSCILLATORTYPE_HSI          0x00000002U   /*!< HSI16 to configure */
#define RCC_OSCILLATORTYPE_LSE          0x00000004U   /*!< LSE to configure */
#define RCC_OSCILLATORTYPE_LSI          0x00000008U   /*!< LSI to configure */
/**
  * @}
  */

/** @defgroup RCC_HSE_Config HSE Config
  * @{
  */
#define RCC_HSE_OFF                     0x00000000U        /*!< HSE clock deactivation */
#define RCC_HSE_ON                      RCC_CR_HSEON       /*!< HSE clock activation */
/**
  * @}
  */

/** @defgroup RCC_HSE_Div HSE Div
  * @{
  */
#define RCC_HSE_DIV1                    0x00000000U        /*!< HSE clock divided by 1 for SYSCLK */
#define RCC_HSE_DIV2                    RCC_CR_HSEPRE      /*!< HSE clock divided by 2 for SYSCLK */
/**
  * @}
  */

/** @defgroup RCC_LSE_Config LSE Config
  * @{
  */
#define RCC_LSE_OFF                     0U                                                        /*!< LSE clock deactivation */
#define RCC_LSE_ON_RTC_ONLY             RCC_BDCR1_LSEON                                           /*!< LSE clock activation for RTC only */
#define RCC_LSE_ON                      (RCC_BDCR1_LSESYSEN | RCC_BDCR1_LSEON)                    /*!< LSE clock activation for RCC and peripherals */
#define RCC_LSE_BYPASS_RTC_ONLY         (RCC_BDCR1_LSEBYP | RCC_BDCR1_LSEON)                      /*!< External clock source for LSE clock */
#define RCC_LSE_BYPASS                  (RCC_BDCR1_LSEBYP | RCC_BDCR1_LSESYSEN | RCC_BDCR1_LSEON) /*!< External clock source for LSE clock */
/**
  * @}
  */

/** @defgroup RCC_HSI_Config HSI Config
  * @{
  */
#define RCC_HSI_OFF                     0x00000000U         /*!< HSI clock deactivation */
#define RCC_HSI_ON                      RCC_CR_HSION        /*!< HSI clock activation */

#define RCC_HSICALIBRATION_DEFAULT      0x10U               /* Default HSI calibration trimming value */
/**
  * @}
  */

/** @defgroup RCC_LSI_Config LSI Config
  * @{
  */
#define RCC_LSI_OFF                    0x00000000U          /*!< LSI clock deactivation */
#define RCC_LSI1_ON                     RCC_BDCR1_LSI1ON    /*!< LSI1 clock activation */
#if defined(RCC_LSI2_SUPPORT)
#define RCC_LSI2_ON                     RCC_BDCR1_LSI2ON    /*!< LSI2 clock activation */
#endif
/**
  * @}
  */

/** @defgroup RCC_LSI_Div LSI Div
  * @{
  */
#define RCC_LSI_DIV1                    0U                    /*!< LSI1 clock is not divided */
#define RCC_LSI_DIV128                  RCC_BDCR1_LSI1PREDIV  /*!< LSI1 clock is divided by 128 */
/**
  * @}
  */

/** @defgroup RCC_PLL_Config  RCC PLL1 Config
  * @{
  */
#define RCC_PLL_NONE                    0x00000000U
#define RCC_PLL_OFF                     0x00000001U
#define RCC_PLL_ON                      0x00000002U
/**
  * @}
  */

/** @defgroup RCC_PLL_Clock_Source  RCC PLL1 Clock Source
  * @{
  */
#define RCC_PLLSOURCE_NONE              0x00000000U
#define RCC_PLLSOURCE_HSI               RCC_PLL1CFGR_PLL1SRC_1
#define RCC_PLLSOURCE_HSE               (RCC_PLL1CFGR_PLL1SRC_1 | RCC_PLL1CFGR_PLL1SRC_0)
/**
  * @}
  */

/** @defgroup RCC_PLL_Clock_Output  RCC PLL1 Clock Output
  * @{
  */
#define RCC_PLL1_PCLK                   RCC_PLL1CFGR_PLL1PEN
#define RCC_PLL1_QCLK                   RCC_PLL1CFGR_PLL1QEN
#define RCC_PLL1_RCLK                   RCC_PLL1CFGR_PLL1REN
/**
  * @}
  */

/** @defgroup RCC_PLL_VCO_Input_Range  RCC PLL1 VCO Input Range
  * @{
  */
#define RCC_PLL_VCOINPUT_RANGE0         0x00000000U
#define RCC_PLL_VCOINPUT_RANGE1         (RCC_PLL1CFGR_PLL1RGE_1 | RCC_PLL1CFGR_PLL1RGE_0)
/**
  * @}
  */

/** @defgroup RCC_System_Clock_Type System Clock Type
  * @{
  */
#define RCC_CLOCKTYPE_SYSCLK            0x00000001U  /*!< SYSCLK to configure */
#define RCC_CLOCKTYPE_HCLK              0x00000002U  /*!< HCLK to configure   */
#define RCC_CLOCKTYPE_PCLK1             0x00000004U  /*!< PCLK1 to configure  */
#define RCC_CLOCKTYPE_PCLK2             0x00000008U  /*!< PCLK2 to configure  */
#define RCC_CLOCKTYPE_PCLK7             0x00000010U  /*!< PCLK7 to configure  */
#define RCC_CLOCKTYPE_HCLK5             0x00000020U  /*!< HCLK5 to configure  */
/**
  * @}
  */

/** @defgroup RCC_System_Clock_Source System Clock Source
  * @{
  */
#define RCC_SYSCLKSOURCE_HSI            0x00000000U                        /*!< HSI16 selection as system clock */
#define RCC_SYSCLKSOURCE_HSE            RCC_CFGR1_SW_1                     /*!< HSE32 or HSE32/32 (depending on HSEPRE) selection as system clock */
#define RCC_SYSCLKSOURCE_PLLCLK         (RCC_CFGR1_SW_1 | RCC_CFGR1_SW_0)  /*!< PLL1R selection as system clock */
/**
  * @}
  */

/** @defgroup RCC_System_Clock_Source_Status System Clock Source Status
  * @{
  */
#define RCC_SYSCLKSOURCE_STATUS_HSI     0x00000000U                         /*!< HSI16 used as system clock */
#define RCC_SYSCLKSOURCE_STATUS_HSE     RCC_CFGR1_SWS_1                     /*!< HSE32 or HSE32/32 (depending on HSEPRE) used as system clock */
#define RCC_SYSCLKSOURCE_STATUS_PLLCLK  (RCC_CFGR1_SWS_1 | RCC_CFGR1_SWS_0) /*!< PLL1R used as system clock */
/**
  * @}
  */

/** @defgroup RCC_AHB_Clock_Source AHB Clock Source
  * @{
  */
#define RCC_SYSCLK_DIV1                 0x00000000U                                                 /*!< SYSCLK not divided */
#define RCC_SYSCLK_DIV2                 RCC_CFGR2_HPRE_2                                            /*!< SYSCLK divided by 2 */
#define RCC_SYSCLK_DIV4                 (RCC_CFGR2_HPRE_2 | RCC_CFGR2_HPRE_0)                       /*!< SYSCLK divided by 4 */
#define RCC_SYSCLK_DIV8                 (RCC_CFGR2_HPRE_2 | RCC_CFGR2_HPRE_1)                       /*!< SYSCLK divided by 8 */
#define RCC_SYSCLK_DIV16                (RCC_CFGR2_HPRE_2 | RCC_CFGR2_HPRE_1 | RCC_CFGR2_HPRE_0)    /*!< SYSCLK divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_APB1_APB2_APB7_Clock_Source APB1 APB2 APB7 Clock Source
  * @{
  */
#define RCC_HCLK_DIV1                   (0x00000000U)                                               /*!< HCLK not divided */
#define RCC_HCLK_DIV2                   RCC_CFGR2_PPRE1_2                                           /*!< HCLK divided by 2 */
#define RCC_HCLK_DIV4                   (RCC_CFGR2_PPRE1_2 | RCC_CFGR2_PPRE1_0)                     /*!< HCLK divided by 4 */
#define RCC_HCLK_DIV8                   (RCC_CFGR2_PPRE1_2 | RCC_CFGR2_PPRE1_1)                     /*!< HCLK divided by 8 */
#define RCC_HCLK_DIV16                  (RCC_CFGR2_PPRE1_2 | RCC_CFGR2_PPRE1_1 | RCC_CFGR2_PPRE1_0) /*!< HCLK divided by 16 */
/**
  * @}
  */

