stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_hal_rcc.h
/** @defgroup RCC_AHB5_PLL1_Clock_Source AHB5 PLL1 Clock Source
  * @{
  */
#define RCC_SYSCLK_PLL1_DIV1            0x00000000U                                                 /*!< SYSCLK when PLL1 is source not divided */
#define RCC_SYSCLK_PLL1_DIV2            RCC_CFGR4_HPRE5_2                                           /*!< SYSCLK when PLL1 is source divided by 2 */
#define RCC_SYSCLK_PLL1_DIV3            (RCC_CFGR4_HPRE5_2 | RCC_CFGR4_HPRE5_0)                     /*!< SYSCLK when PLL1 is source divided by 3 */
#define RCC_SYSCLK_PLL1_DIV4            (RCC_CFGR4_HPRE5_2 | RCC_CFGR4_HPRE5_1)                     /*!< SYSCLK when PLL1 is source divided by 4 */
#define RCC_SYSCLK_PLL1_DIV6            (RCC_CFGR4_HPRE5_2 | RCC_CFGR4_HPRE5_1 | RCC_CFGR4_HPRE5_0) /*!< SYSCLK when PLL1 is source divided by 6 */
/**
  * @}
  */

/** @defgroup RCC_AHB5_HSEHSI_Clock_Source AHB5 HSEHSI Clock Source
  * @{
  */
#define RCC_SYSCLK_HSEHSI_DIV1          0x00000000U         /*!< SYSCLK when HSE or HSI is source not divided */
#define RCC_SYSCLK_HSEHSI_DIV2          RCC_CFGR4_HDIV5     /*!< SYSCLK when HSE or HSI is source divided by 2 */
/**
  * @}
  */

/** @defgroup RCC_RTC_Clock_Source RTC Clock Source
  * @{
  */
#define RCC_RTCCLKSOURCE_DISABLE        0x00000000U         /*!< RTC clock is disabled */
#define RCC_RTCCLKSOURCE_LSE            RCC_BDCR1_RTCSEL_0  /*!< LSE oscillator clock used as RTC clock */
#define RCC_RTCCLKSOURCE_LSI            RCC_BDCR1_RTCSEL_1  /*!< LSI1 or LIS2 oscillator clock used as RTC clock */
#define RCC_RTCCLKSOURCE_HSE_DIV32      RCC_BDCR1_RTCSEL    /*!< HSE32 oscillator clock divided by 32 used as RTC clock */
/**
  * @}
  */

/** @defgroup RCC_MCO_Index MCO Index
  * @{
  */
#define RCC_MCO1                        0x00000000U
#define RCC_MCO                         RCC_MCO1            /*!< MCO1 to be compliant with other families with 2 MCOs*/
/**
  * @}
  */

/** @defgroup RCC_MCO1_Clock_Source MCO1 Clock Source
  * @{
  */
#define RCC_MCO1SOURCE_NOCLOCK          0x00000000U                                                     /*!< MCO1 output disabled, no clock on MCO1 */
#define RCC_MCO1SOURCE_SYSCLK           RCC_CFGR1_MCOSEL_0                                              /*!< SYSCLK selection as MCO1 source */
#define RCC_MCO1SOURCE_HSI              (RCC_CFGR1_MCOSEL_1 | RCC_CFGR1_MCOSEL_0)                       /*!< HSI16 selection as MCO1 source */
#define RCC_MCO1SOURCE_HSE              RCC_CFGR1_MCOSEL_2                                              /*!< HSE32 selection as MCO1 source */
#define RCC_MCO1SOURCE_PLL1RCLK         (RCC_CFGR1_MCOSEL_2 | RCC_CFGR1_MCOSEL_0)                       /*!< PLL1RCLK selection as MCO1 source */
#define RCC_MCO1SOURCE_LSI              (RCC_CFGR1_MCOSEL_2 | RCC_CFGR1_MCOSEL_1)                       /*!< LSI selection as MCO1 source */
#define RCC_MCO1SOURCE_LSE              (RCC_CFGR1_MCOSEL_2 | RCC_CFGR1_MCOSEL_1 | RCC_CFGR1_MCOSEL_0)  /*!< LSE selection as MCO1 source */
#define RCC_MCO1SOURCE_PLL1PCLK         RCC_CFGR1_MCOSEL_3                                              /*!< PLL1PCLK selection as MCO1 source */
#define RCC_MCO1SOURCE_PLL1QCLK         (RCC_CFGR1_MCOSEL_3 | RCC_CFGR1_MCOSEL_0)                       /*!< PLL1QCLK selection as MCO1 source */
#define RCC_MCO1SOURCE_HCLK5            (RCC_CFGR1_MCOSEL_3 | RCC_CFGR1_MCOSEL_1)                       /*!< HCLK5 selection as MCO1 source */
/**
  * @}
  */

/** @defgroup RCC_MCOx_Clock_Prescaler MCO1 Clock Prescaler
  * @{
  */
#define RCC_MCODIV_1                    0x00000000U                               /*!< MCO is divided by 1 */
#define RCC_MCODIV_2                    RCC_CFGR1_MCOPRE_0                        /*!< MCO is divided by 2 */
#define RCC_MCODIV_4                    RCC_CFGR1_MCOPRE_1                        /*!< MCO is divided by 4 */
#define RCC_MCODIV_8                    (RCC_CFGR1_MCOPRE_1 | RCC_CFGR1_MCOPRE_0) /*!< MCO is divided by 8 */
#define RCC_MCODIV_16                   RCC_CFGR1_MCOPRE_2                        /*!< MCO is divided by 16 */
/**
  * @}
  */

#if defined(RCC_CCIPR2_ASSEL)
/** @defgroup RCC_Interrupt Interrupts
  *        Elements values convention: XXXYYYYYb
  *           - YYYYY  : Flag position in the register
  *           - XXX  : Register index
  *                 - 000: CIFR register
  *                 - 001: ASSR register
  * @{
  */
/* Flags in the CIFR register */
#define RCC_IT_LSI1RDY                  ((CIFR_REG_INDEX << 5U) | RCC_CIFR_LSI1RDYF_Pos)    /*!< LSI1 Ready Interrupt flag */
#define RCC_IT_LSERDY                   ((CIFR_REG_INDEX << 5U) | RCC_CIFR_LSERDYF_Pos)     /*!< LSE Ready Interrupt flag */
#define RCC_IT_HSIRDY                   ((CIFR_REG_INDEX << 5U) | RCC_CIFR_HSIRDYF_Pos)     /*!< HSI16 Ready Interrupt flag */
#define RCC_IT_HSERDY                   ((CIFR_REG_INDEX << 5U) | RCC_CIFR_HSERDYF_Pos)     /*!< HSE Ready Interrupt flag */
#define RCC_IT_PLL1RDY                  ((CIFR_REG_INDEX << 5U) | RCC_CIFR_PLL1RDYF_Pos)    /*!< PLL1 Ready Interrupt flag */
#define RCC_IT_CSS                      ((CIFR_REG_INDEX << 5U) | RCC_CIFR_HSECSSF_Pos)     /*!< HSE32 Clock Security System Interrupt flag */
#if defined(RCC_LSI2_SUPPORT)
#define RCC_IT_LSI2RDY                  ((CIFR_REG_INDEX << 5U) | RCC_CIFR_LSI2RDYF_Pos)    /*!< LSI2 Ready Interrupt flag */
#endif /* RCC_BDCR1_LSI2ON */

/* Flags in the ASSR register */
#define RCC_IT_CAPTURE_ERROR            ((ASSR_REG_INDEX << 5U) | RCC_ASSR_CAEF_Pos)        /*!< Capture Error Interrupt flag */
#define RCC_IT_COMPARER                 ((ASSR_REG_INDEX << 5U) | RCC_ASSR_COF_Pos)         /*!< Comparer Interrupt flag */
#define RCC_IT_CAPTURE_TRIGGER          ((ASSR_REG_INDEX << 5U) | RCC_ASSR_CAF_Pos)         /*!< Capture Trigger Interrupt flag */
/**
  * @}
  */
#else
/** @defgroup RCC_Interrupt Interrupts
  * @{
  */
#define RCC_IT_LSI1RDY                  RCC_CIFR_LSI1RDYF     /*!< LSI1 Ready Interrupt flag */
#define RCC_IT_LSERDY                   RCC_CIFR_LSERDYF      /*!< LSE Ready Interrupt flag */
#define RCC_IT_HSIRDY                   RCC_CIFR_HSIRDYF      /*!< HSI16 Ready Interrupt flag */
#define RCC_IT_HSERDY                   RCC_CIFR_HSERDYF      /*!< HSE Ready Interrupt flag */
#define RCC_IT_PLL1RDY                  RCC_CIFR_PLL1RDYF     /*!< PLL1 Ready Interrupt flag */
#define RCC_IT_CSS                      RCC_CIFR_HSECSSF      /*!< HSE32 Clock Security System Interrupt flag */
#if defined(RCC_LSI2_SUPPORT)
#define RCC_IT_LSI2RDY                  RCC_CIFR_LSI2RDYF     /*!< LSI2 Ready Interrupt flag */
#endif /* RCC_BDCR1_LSI2ON */
/**
  * @}
  */
 #endif /* RCC_CCIPR2_ASSEL */

/** @defgroup RCC_Flag Flags
  *        Elements values convention: XXXYYYYYb
  *           - YYYYY  : Flag position in the register
  *           - XXX  : Register index
  *                 - 001: CR register
  *                 - 010: BDCR1 register
  *                 - 011: CSR register
  * @{
  */
/* Flags in the CR register */
#define RCC_FLAG_HSIRDY                 ((CR_REG_INDEX << 5U) | RCC_CR_HSIRDY_Pos)   /*!< HSI Ready flag */
#define RCC_FLAG_HSERDY                 ((CR_REG_INDEX << 5U) | RCC_CR_HSERDY_Pos)   /*!< HSE Ready flag */
#define RCC_FLAG_PLL1RDY                ((CR_REG_INDEX << 5U) | RCC_CR_PLL1RDY_Pos)  /*!< PLL1 Ready flag */

/* Flags in the BDCR1 register */
#define RCC_FLAG_LSERDY                 ((BDCR1_REG_INDEX << 5U) | RCC_BDCR1_LSERDY_Pos)    /*!< LSE Ready flag */
#define RCC_FLAG_LSESYSRDY              ((BDCR1_REG_INDEX << 5U) | RCC_BDCR1_LSESYSRDY_Pos) /*!< LSESYS Ready flag */
#define RCC_FLAG_LSECSSD                ((BDCR1_REG_INDEX << 5U) | RCC_BDCR1_LSECSSD_Pos)   /*!< LSE Clock Security System Interrupt flag */
#define RCC_FLAG_LSI1RDY                ((BDCR1_REG_INDEX << 5U) | RCC_BDCR1_LSI1RDY_Pos)   /*!< LSI1 Ready flag */
#if defined(RCC_LSI2_SUPPORT)
#define RCC_FLAG_LSI2RDY                ((BDCR1_REG_INDEX << 5U) | RCC_BDCR1_LSI2RDY_Pos)   /*!< LSI2 Ready flag */
#endif /* RCC_BDCR1_LSI2ON */

