stm32duino/Arduino_Core_STM32/system/Drivers/STM32WBAxx_HAL_Driver/Inc/stm32wbaxx_hal_rcc.h
/**
  * @brief  Macro to configure the External Low Speed oscillator (LSE) drive capability.
  * @note   As the LSE is in the Backup domain and write access is denied to
  *         this domain after reset, you have to enable write access using
  *         HAL_PWR_EnableBkUpAccess() function before to configure the LSE
  *         (to be done once after reset).
  * @note   The LSE drive can be decreased to the lower drive capability (LSEDRV = 0)
  *         when the LSE is ON. However, once LSEDRV is selected, the drive
  *         capability can not be increased if LSEON = 1.
  * @param  __LSEDRIVE__: specifies the new state of the LSE drive capability.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_LSEDRIVE_MEDIUMLOW  LSE oscillator medium low drive capability.
  *            @arg @ref RCC_LSEDRIVE_MEDIUMHIGH  LSE oscillator medium high drive capability.
  *            @arg @ref RCC_LSEDRIVE_HIGH  LSE oscillator high drive capability.
  * @retval None
  */
#define __HAL_RCC_LSEDRIVE_CONFIG(__LSEDRIVE__) MODIFY_REG(RCC->BDCR1, RCC_BDCR1_LSEDRV, (__LSEDRIVE__))

/**
  * @brief  Macro to configure the MCO clock.
  * @param  __MCOCLKSOURCE__ specifies the MCO clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_MCO1SOURCE_NOCLOCK  MCO output disabled
  *            @arg @ref RCC_MCO1SOURCE_SYSCLK  System  clock selected as MCO source
  *            @arg @ref RCC_MCO1SOURCE_HSI  HSI clock selected as MCO source
  *            @arg @ref RCC_MCO1SOURCE_HSE  HSE clock selected as MCO source
  *            @arg @ref RCC_MCO1SOURCE_PLL1RCLK  Main PLL1 clock selected as MCO source
  *            @arg @ref RCC_MCO1SOURCE_LSI  LSI clock selected as MCO source
  *            @arg @ref RCC_MCO1SOURCE_LSE  LSE clock selected as MCO source
  *            @arg @ref RCC_MCO1SOURCE_PLL1PCLK  pll1pclk selected as MCO source
  *            @arg @ref RCC_MCO1SOURCE_PLL1QCLK  pll1qclk selected as MCO source
  *            @arg @ref RCC_MCO1SOURCE_HCLK5  phclk5 selected as MCO source
  * @param  __MCODIV__ specifies the MCO clock prescaler.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_MCODIV_1   MCO clock source is divided by 1
  *            @arg @ref RCC_MCODIV_2   MCO clock source is divided by 2
  *            @arg @ref RCC_MCODIV_4   MCO clock source is divided by 4
  *            @arg @ref RCC_MCODIV_8   MCO clock source is divided by 8
  *            @arg @ref RCC_MCODIV_16  MCO clock source is divided by 16
  */
#define __HAL_RCC_MCO1_CONFIG(__MCOCLKSOURCE__, __MCODIV__) \
  MODIFY_REG(RCC->CFGR1, (RCC_CFGR1_MCOSEL | RCC_CFGR1_MCOPRE), ((__MCOCLKSOURCE__) | (__MCODIV__)))

/** @defgroup RCC_Flags_Interrupts_Management Flags Interrupts Management
  * @brief macros to manage the specified RCC Flags and interrupts.
  * @{
  */

/**
  * @brief  Enable RCC interrupt (Perform Byte access to RCC_CIR[14:8] bits to enable
  *         the selected interrupts).
  * @param  __INTERRUPT__: specifies the RCC interrupt sources to be enabled.
  *         This parameter can be any combination of the following values:
  *            @arg @ref RCC_IT_LSI1RDY         LSI1 ready interrupt
  *            @arg @ref RCC_IT_LSERDY          LSE ready interrupt
  *            @arg @ref RCC_IT_HSIRDY          HSI ready interrupt
  *            @arg @ref RCC_IT_HSERDY          HSE ready interrupt
  *            @arg @ref RCC_IT_PLL1RDY         PLL1 ready interrupt
  *            @arg @ref RCC_IT_CSS             HSE32 Clock Security System Interrupt
  *            @arg @ref RCC_IT_LSI2RDY         LSI2 ready interrupt(*)
#if defined(RCC_CCIPR2_ASSEL)
  *            @arg @ref RCC_IT_CAPTURE_ERROR   Capture Error Interrupt flag(*)
  *            @arg @ref RCC_IT_COMPARER        Comparer Interrupt flag(*)
  *            @arg @ref RCC_IT_CAPTURE_TRIGGER Capture Trigger Interrupt flag(*)
#endif
  * (*) Feature not available on all devices of the family
  * @retval None
  */
#if defined(RCC_CCIPR2_ASSEL)
#define __HAL_RCC_ENABLE_IT(__INTERRUPT__) ((((__INTERRUPT__) >> 5U) == 0U) ? \
                                             SET_BIT(RCC->CIER,1U << ((__INTERRUPT__) & RCC_FLAG_MASK)) : \
                                             SET_BIT(RCC->ASIER,1U << ((__INTERRUPT__) & RCC_FLAG_MASK)))
#else
#define __HAL_RCC_ENABLE_IT(__INTERRUPT__) SET_BIT(RCC->CIER, (__INTERRUPT__))
#endif /* RCC_CCIPR2_ASSEL */

/**
  * @brief Disable RCC interrupt (Perform Byte access to RCC_CIR[14:8] bits to disable
  *        the selected interrupts).
  * @param  __INTERRUPT__: specifies the RCC interrupt sources to be disabled.
  *         This parameter can be any combination of the following values:
  *            @arg @ref RCC_IT_LSI1RDY         LSI1 ready interrupt
  *            @arg @ref RCC_IT_LSERDY          LSE ready interrupt
  *            @arg @ref RCC_IT_HSIRDY          HSI ready interrupt
  *            @arg @ref RCC_IT_HSERDY          HSE ready interrupt
  *            @arg @ref RCC_IT_PLL1RDY         PLL1 ready interrupt
  *            @arg @ref RCC_IT_CSS             HSE32 Clock Security System Interrupt
  *            @arg @ref RCC_IT_LSI2RDY         LSI2 ready interrupt(*)
#if defined(RCC_CCIPR2_ASSEL)
  *            @arg @ref RCC_IT_CAPTURE_ERROR   Capture Error Interrupt flag(*)
  *            @arg @ref RCC_IT_COMPARER        Comparer Interrupt flag(*)
  *            @arg @ref RCC_IT_CAPTURE_TRIGGER Capture Trigger Interrupt flag(*)
#endif
  * (*) Feature not available on all devices of the family
  * @retval None
  */
#if defined(RCC_CCIPR2_ASSEL)
#define __HAL_RCC_DISABLE_IT(__INTERRUPT__) ((((__INTERRUPT__) >> 5U) == 0U) ? \
                                              CLEAR_BIT(RCC->CIER,1U << ((__INTERRUPT__) & RCC_FLAG_MASK)) : \
                                              CLEAR_BIT(RCC->ASIER,1U << ((__INTERRUPT__) & RCC_FLAG_MASK)))
#else
#define __HAL_RCC_DISABLE_IT(__INTERRUPT__) CLEAR_BIT(RCC->CIER, (__INTERRUPT__))
#endif /* RCC_CCIPR2_ASSEL */

/**
  * @brief  Clear the RCC's interrupt pending bits (Perform Byte access to RCC_CIR[23:16]
  *         bits to clear the selected interrupt pending bits.
  * @param  __INTERRUPT__: specifies the interrupt pending bit to clear.
  *         This parameter can be any combination of the following values:
  *            @arg @ref RCC_IT_LSI1RDY         LSI1 ready interrupt
  *            @arg @ref RCC_IT_LSERDY          LSE ready interrupt
  *            @arg @ref RCC_IT_HSIRDY          HSI ready interrupt
  *            @arg @ref RCC_IT_HSERDY          HSE ready interrupt
  *            @arg @ref RCC_IT_PLL1RDY         PLL1 ready interrupt
  *            @arg @ref RCC_IT_CSS             HSE32 Clock Security System Interrupt
  *            @arg @ref RCC_IT_LSI2RDY         LSI2 ready interrupt(*)
#if defined(RCC_CCIPR2_ASSEL)
  *            @arg @ref RCC_IT_CAPTURE_ERROR   Capture Error Interrupt flag(*)
  *            @arg @ref RCC_IT_COMPARER        Comparer Interrupt flag(*)
  *            @arg @ref RCC_IT_CAPTURE_TRIGGER Capture Trigger Interrupt flag(*)
#endif
  * (*) Feature not available on all devices of the family
  * @retval None
  */
#if defined(RCC_CCIPR2_ASSEL)
#define __HAL_RCC_CLEAR_IT(__INTERRUPT__) ((((__INTERRUPT__) >> 5U) == 0U) ? \
                                           WRITE_REG(RCC->CICR,1U << ((__INTERRUPT__) & RCC_FLAG_MASK)) : \
                                           CLEAR_BIT(RCC->ASSR,1U << ((__INTERRUPT__) & RCC_FLAG_MASK)))
#else
#define __HAL_RCC_CLEAR_IT(__INTERRUPT__) WRITE_REG(RCC->CICR, (__INTERRUPT__))
#endif /* RCC_CCIPR2_ASSEL */

/** @brief  Check whether the RCC interrupt has occurred or not.
  * @param  __INTERRUPT__: specifies the RCC interrupt source to check.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_IT_LSI1RDY         LSI1 ready interrupt
  *            @arg @ref RCC_IT_LSERDY          LSE ready interrupt
  *            @arg @ref RCC_IT_HSIRDY          HSI ready interrupt
  *            @arg @ref RCC_IT_HSERDY          HSE ready interrupt
  *            @arg @ref RCC_IT_PLL1RDY         PLL1 ready interrupt
  *            @arg @ref RCC_IT_CSS             HSE32 Clock Security System Interrupt
  *            @arg @ref RCC_IT_LSI2RDY         LSI2 ready interrupt(*)
#if defined(RCC_CCIPR2_ASSEL)
  *            @arg @ref RCC_IT_CAPTURE_ERROR   Capture Error Interrupt flag(*)
  *            @arg @ref RCC_IT_COMPARER        Comparer Interrupt flag(*)
  *            @arg @ref RCC_IT_CAPTURE_TRIGGER Capture Trigger Interrupt flag(*)
#endif
  * (*) Feature not available on all devices of the family
  * @retval The new state of __INTERRUPT__ (TRUE or FALSE).
  */
#if defined(RCC_CCIPR2_ASSEL)
#define __HAL_RCC_GET_IT(__INTERRUPT__) ((((__INTERRUPT__) >> 5U) == 0U) ? \
                                         ((RCC->CIFR & (1U << ((__INTERRUPT__) & RCC_FLAG_MASK))) == (1U << ((__INTERRUPT__) & RCC_FLAG_MASK))) : \
                                         ((RCC->ASSR & (1U << ((__INTERRUPT__) & RCC_FLAG_MASK))) == (1U << ((__INTERRUPT__) & RCC_FLAG_MASK))))
#else
#define __HAL_RCC_GET_IT(__INTERRUPT__)  ((RCC->CIFR & (__INTERRUPT__)) == (__INTERRUPT__))
#endif /* RCC_CCIPR2_ASSEL */

/** @brief Set RMVF bit to clear the reset flags.
  *        The reset flags are: RCC_FLAG_FWRRST, RCC_FLAG_OBLRST, RCC_FLAG_PINRST, RCC_FLAG_BORRST,
  *        RCC_FLAG_SFTRST, RCC_FLAG_IWDGRST, RCC_FLAG_WWDGRST and RCC_FLAG_LPWRRST.
  * @retval None
  */
#define __HAL_RCC_CLEAR_RESET_FLAGS() (RCC->CSR |= RCC_CSR_RMVF)

/**
  * @brief  Check whether the selected RCC flag is set or not.
  * @param  __FLAG__: specifies the flag to check.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_FLAG_HSIRDY   HSI oscillator clock ready
  *            @arg @ref RCC_FLAG_HSERDY   HSE oscillator clock ready
  *            @arg @ref RCC_FLAG_PLL1RDY  PLL1 clock ready
  *            @arg @ref RCC_FLAG_LSERDY   LSE oscillator clock ready
  *            @arg @ref RCC_FLAG_LSECSSD  Clock security system failure on LSE oscillator detection
  *            @arg @ref RCC_FLAG_LSI1RDY  LSI1 oscillator clock ready
  *            @arg @ref RCC_FLAG_LSI2RDY  LSI2 oscillator clock ready(*)
  *            @arg @ref RCC_FLAG_BORRST   BOR reset
  *            @arg @ref RCC_FLAG_OBLRST   OBLRST reset
  *            @arg @ref RCC_FLAG_PINRST   Pin reset
  *            @arg @ref RCC_FLAG_SFTRST   Software reset
  *            @arg @ref RCC_FLAG_IWDGRST  Independent Watchdog reset
  *            @arg @ref RCC_FLAG_WWDGRST  Window Watchdog reset(*)
  *            @arg @ref RCC_FLAG_LPWRRST  Low Power reset
  * (*) Feature not available on all devices of the family
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_RCC_GET_FLAG(__FLAG__) ((((((((__FLAG__) >> 5U) == 1U) ? RCC->CR :                     \
                                          ((((__FLAG__) >> 5U) == 2U) ? RCC->BDCR1 :                   \
                                           ((((__FLAG__) >> 5U) == 3U) ? RCC->CSR : RCC->CIFR)))) &     \
                                        (1U << ((__FLAG__) & RCC_FLAG_MASK))) != 0U) ? 1U : 0U)
/**
  * @}
  */

/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup RCC_Private_Constants RCC Private Constants
  * @{
  */
#define PLL_VCOINPUTFREQ_MAX            16000000U /* Maximum VCO input frequency is 16 MHz */
#define PLL_VCOINPUTFREQ_MIN             4000000U /* Minimum VCO input frequency is 4 MHz */
#define HSE_TIMEOUT_VALUE               HSE_STARTUP_TIMEOUT
#define HSI_TIMEOUT_VALUE               (2U)      /* 2 ms (minimum Tick + 1) */


/* Defines used for Flags */
#define CR_REG_INDEX                    (1U)
#define BDCR1_REG_INDEX                 (2U)
#define CSR_REG_INDEX                   (3U)
#if defined(RCC_CCIPR2_ASSEL)
/* Defines used for Interrupt Flags */
#define CIFR_REG_INDEX                  (0U)
#define ASSR_REG_INDEX                  (1U)
#endif /* RCC_CCIPR2_ASSEL */

#define RCC_FLAG_MASK                   (0x1FU)

/* Define used for IS_RCC_* below */
#define RCC_CLOCKTYPE_ALL               (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_HCLK5 | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2 | RCC_CLOCKTYPE_PCLK7)  /*!< All clocktype to configure */
#define RCC_OSCILLATORTYPE_ALL          (RCC_OSCILLATORTYPE_HSE | RCC_OSCILLATORTYPE_HSI | RCC_OSCILLATORTYPE_LSE | RCC_OSCILLATORTYPE_LSI)  /*!< All Oscillator to configure */

/**
  * @}
  */

